{
  "slides": {
    "hello": {
      "title": "Hi, I'm <strong><x-lesanim offsetY=40>Les.</x-lesanim></strong>",
      "previousSlide": null,
      "nextSlide": "dev-skills",
      "blurbMarkup": "<p>I’m a human based in Glasgow, Scotland. I have experience <em><strong>solving</strong></em> a wide variety of <em><strong>problems</strong></em> in both front-end and back-end domains.</p><p>Day to day, I’m a <em><strong>JavaScript Developer.</strong></em></p><p>But really, I just like making cool stuff with just about anything.</p><p>Let me show you what I do and why I do it.</p>",
      "palette": {
        "gradient": "to bottom right, #eee6ee, #d9d9d9",
        "offsetOpacity": 0.3,
        "colors": [
          "#eee6ee",
          "#d9d9d9"
        ]
      }
    },
    "dev-skills": {
      "title": "show me what you got.",
      "previousSlide": "hello",
      "nextSlide": "soft-skills",
      "blurbMarkup": "<p>I would describe myself as a jack of all trades, master of some.</p><p>Whilst I mostly work day to day in <em><strong>JavaScript</strong></em> / <em><strong>React</strong></em> / <em><strong>Redux</strong></em> / <em><strong>CSS</strong></em> / <em><strong>HTML5</strong></em>, I have also gained some experience in other languages, frameworks and tech.</p><p>My real passion is the <em><strong>web as a platform</strong></em> and all the cool APIs that come along with it such as WebGL, WebAudio, WebMIDI, PWAs, and how they can all be tied together into new and awesome things.</p><p>Click on a skill for more info or click-drag to move around.</p>",
      "palette": {
        "gradient": "to bottom right, #eee6ee, #d9d9d9",
        "offsetOpacity": 0.3,
        "colors": [
          "#eee6ee",
          "#d9d9d9"
        ]
      }
    },
    "soft-skills": {
      "title": "I wear many hats, though.",
      "previousSlide": "dev-skills",
      "nextSlide": "up-next",
      "blurbMarkup": "<p>Through work, travelling and education. I’ve accrued a variety of non-dev skills too.</p><p>Click on a skill for more info or click-drag to move around.</p>",
      "palette": {
        "gradient": "to bottom right, #eee6ee, #d9d9d9",
        "offsetOpacity": 0.3,
        "colors": [
          "#eee6ee",
          "#d9d9d9"
        ]
      }
    },
    "up-next": {
      "title": "and it's a big 'ol internet out there.",
      "previousSlide": "soft-skills",
      "nextSlide": "human-too",
      "blurbMarkup": "<p>It’s a big ‘ol internet out there. There’s still so much more I want to learn, contribute to and build upon.</p><p>Learning is a journey, not a destination, you can never know everything.  But I want to give it a damn good shot.</p>",
      "palette": {
        "gradient": "to bottom right, #eee6ee, #d9d9d9",
        "offsetOpacity": 0.3,
        "colors": [
          "#eee6ee",
          "#d9d9d9"
        ]
      }
    },
    "human-too": {
      "title": "being human is good too.",
      "previousSlide": "up-next",
      "nextSlide": "social-proof",
      "blurbMarkup": "<p>As an important aside, I’m also a person,<span>a user,</span><span>a vegetable grower,</span><span>a tinkerer,</span><span>a builder of things,</span><span>a jack of all trades,</span><span>a master of some,</span><span>an idealist,</span><span>a realist,</span><span>a lifelong learner,</span><span>a dog dad,</span><span>a hillwalker,</span><span>a nature enthusiast,</span><span>uma aluna de Português,</span><span>a big Led Zep Fan,</span><span>an okay musician,</span><span>a book lover,</span><span>a wannabe stoic,</span><span>a Trekkie/er,</span><span>a (mostly) good guy,</span><span>a damn good cook,</span><span>an enthusiastic, but terrible, dancer</span> and <span>maker of the best god damn hot sauce in Scotland, possibly Europe</span>(yeah, you heard me).</p>",
      "palette": {
        "gradient": "to bottom right, #eee6ee, #d9d9d9",
        "offsetOpacity": 0.3,
        "colors": [
          "#eee6ee",
          "#d9d9d9"
        ]
      }
    },
    "social-proof": {
      "title": "but don't take my word for it.",
      "previousSlide": "human-too",
      "nextSlide": "hire-me",
      "blurbMarkup": "<p>See what the people I've worked with have to say.</p>",
      "palette": {
        "gradient": "to bottom right, #eee6ee, #d9d9d9",
        "offsetOpacity": 0.3,
        "colors": [
          "#eee6ee",
          "#d9d9d9"
        ]
      }
    },
    "hire-me": {
      "title": "so, you should totally hire me.",
      "previousSlide": "social-proof",
      "nextSlide": null,
      "blurbMarkup": "<p>And so, we reach the end of our journey together for now. It’s been fun.</p><p>If you’re contemplating hiring me, or just want to leave some (constructive) feedback, don’t hesitate to contact me through any of the channels below.</p>",
      "palette": {
        "gradient": "to bottom right, #eee6ee, #d9d9d9",
        "offsetOpacity": 0.3,
        "colors": [
          "#eee6ee",
          "#d9d9d9"
        ]
      }
    }
  },
  "skills": [
    {
      "id": "js",
      "type": "DEV_SKILLS",
      "name": "JS / ECMA.",
      "points": 8,
      "desc": "<p>Used in both client and serverside applications, JavaScript is the language of the web.  I use javascript on a daily basis both for work and personal projects and have experience on building both client and serverside apps. Knowing the platform is more important that knowing any framework.</p>"
    },
    {
      "id": "react",
      "type": "DEV_SKILLS",
      "name": "ReactJS.",
      "points": 7,
      "desc": "<p>ReactJS is the most popular javascript view library currently in use and component based architecture isn't going anywhere anytime soon.  I have several years experience using react on both client and server side envs. React 16 is the current iteration and I'm looking forward to getting stuck into things like portals, suspense, server side streaming etc.</p>"
    },
    {
      "id": "redux",
      "type": "DEV_SKILLS",
      "name": "Redux.",
      "points": 6,
      "desc": "<p>Redux is the goto library for state management in React apps.  Despite the learning curve, it's minimal API makes state management so much easier and gives the developer awesome \"time-travelling\" tools for debugging.  It's, like, my favourite thing ever.</p>"
    },
    {
      "id": "functional",
      "type": "DEV_SKILLS",
      "name": "Functional Programming / Recompose / Ramda",
      "points": 4,
      "desc": "<p>Functional programming in JS is a big deal these days. Whilst it's not the best choice for <em>every</em> scenario.  It does make things more deterministic and testable and is ideal for using alongside React / Redux in UI development.  I try to write in a functional style where it's applicable. Recompose and Ramda are two libraries that help greatly in doing so, i've used both in personal and work projects.</p>"
    },
    {
      "id": "angular",
      "type": "DEV_SKILLS",
      "name": "Angular 1.",
      "points": 2,
      "desc": "<p>I've worked on products that use Angular 1, It's been...interesting.  It's not ideal and the Angular project has changed a lot since but, push come to shove I could pick it up again.</p>"
    },
    {
      "id": "jquery",
      "type": "DEV_SKILLS",
      "name": "jQuery.",
      "points": 4,
      "desc": "<p>Good 'ol jquery, still in use today.  Any JS dev has almost certainly worked with jQuery at some point.  It's easy no-nonsense API has inspired many features commonly in use on the web today including DOM stuff like querySelector and classList to server side markup traversers like Cheerio and the like.</p>"
    },
    {
      "id": "ssr",
      "type": "DEV_SKILLS",
      "name": "SSR / Next.js.",
      "points": 8,
      "desc": "<p>Server side rendering and universal Javascript apps are a big deal and can save on time, money and dev resources.  I've experience in using SSR frameworks such as Next.js for react</p>"
    },
    {
      "id": "express",
      "type": "DEV_SKILLS",
      "name": "ExpressJS.",
      "points": 5,
      "desc": "<p>Express is the current defacto routing library for node servers.  I've used Express, among others, for both personal an professional projects.</p>"
    },
    {
      "id": "node",
      "type": "DEV_SKILLS",
      "name": "NodeJS.",
      "points": 5,
      "desc": "<p>Node is one of the biggest things to happen to web devlopment in the past ten years and has paved the way for universal javascript apps, build pipelines and heavy concurrency. Ryan Dhal, you have changed the world.  Again, being a JS dev I use node on a daily basis.  At some point I'd like to get deeper down into the lower level stuff surrounding node.</p>"
    },
    {
      "id": "pwa",
      "type": "DEV_SKILLS",
      "name": "PWAs.",
      "points": 5,
      "desc": "<p>Progressive web app encompass a suite of technologies and, once fully adopted across browsers, are likely to change the way we use and develop apps.  I've experience in building PWAs and the assorted engineering problems that arise.  In fact, this CV is a PWA.</p>"
    },
    {
      "id": "webgl",
      "type": "DEV_SKILLS",
      "name": "ThreeJS / WebGL / Pixi / StackGL / GSL.",
      "points": 6,
      "desc": "<p>Aw man, I love this stuff.  WebGL is just great for smooth 3D / 2D Graphics in the browser.  As part of a presentation in work, and to understand the API a bit better, I built my own WebGl library from the ground up.  But I tend to use tried and tested libraries like Three.js, Pixi or the more modular StackGL.  Although graphics programming is <em>hard</em>, I've been learning GSL, and it's been fun.</p>"
    },
    {
      "id": "p5",
      "type": "DEV_SKILLS",
      "name": "p5JS / toxiclibs / matter-js.",
      "points": 3,
      "desc": "<p>I love code-as-art. And have experience of using the above libraries as part of my own creative projects.  Some of them are used in this CV, have a look at the <strong><em>code</em><strong> if you're interested</p>"
    },
    {
      "id": "mongo",
      "type": "DEV_SKILLS",
      "name": "MongoDB / Mongoose.",
      "points": 3.5,
      "desc": "<p>Through personal projects I've implemented and used MongoDB and Mongoose.</p>"
    },
    {
      "id": "webpack",
      "type": "DEV_SKILLS",
      "name": "Webpack.",
      "points": 4,
      "desc": "<p>I'd say I'm comfortable setting up a webpack config from scratch.</p>"
    },
    {
      "id": "gulp",
      "type": "DEV_SKILLS",
      "name": "Gulp.",
      "points": 3,
      "desc": "<p>Various projects I've worked on have used Gulp as part of the build pipeline</p>"
    },
    {
      "id": "test",
      "type": "DEV_SKILLS",
      "name": "TDD / Jest / Enzyme.",
      "points": 5,
      "desc": "<p>I've gained experince using Jest and Enzyme for unit / snapshot testing.  Writing tests beforehand can be helpful in determining</p>"
    },
    {
      "id": "npm",
      "type": "DEV_SKILLS",
      "name": "NPM / Yarn.",
      "points": 4,
      "desc": "<p>Again, working with node means using NPM on a daily basis, although tbh, I prefer Yarn as it tends to be faster and, dare I say it, more reliable.</p>"
    },
    {
      "id": "git",
      "type": "DEV_SKILLS",
      "name": "git jiggy with it.",
      "points": 4,
      "desc": "<p>I've always used git for version control and am comfortable pushing, pulling, merging, cherry-picking and all that jazz.</p>"
    },
    {
      "id": "cli",
      "type": "DEV_SKILLS",
      "name": "Bash / Zsh / CLI / Linux.",
      "points": 4,
      "desc": "<p>Again, the terminal is something I use on a daily basis.  I have some experience in SSH and Linux, I'm still trying to pick up the finer points of bash.</p>"
    },
    {
      "id": "html5",
      "type": "DEV_SKILLS",
      "name": "HTML5",
      "points": 6,
      "desc": "<p>HTML5 Brings to the table loads of new APIs, elements etc.  I have experience in working with HTML5 </p>"
    },
    {
      "id": "css",
      "type": "DEV_SKILLS",
      "name": "CSS / SASS / Styled-JSX.",
      "points": 6,
      "desc": "<p>As front-end I have been using CSS for almost all of my career. SASS (original syntax :P) was a big help in organising styles.  What I'm really into at the moment, however, is CSS-in-JS style solutions for React.  My favourite currently being <a target=_blank href='//zeit.co'>Zeit's</a> Styled-JSX.</p>"
    },
    {
      "id": "seo",
      "type": "DEV_SKILLS",
      "name": "Structured Data / LD + JSON.",
      "points": 4,
      "desc": "<p>Search engines prefer pages to be structured correctly and using the correct semantics.  Working as part of a new platform, SEO is important and structired data and correct semantics help in getting content out there.  </p>"
    },
    {
      "id": "processing",
      "type": "DEV_SKILLS",
      "name": "Processing | (Java).",
      "points": 2,
      "desc": "<p>I love playing about with processing and have picked up a little bit of Java in doing so.</p>"
    },
    {
      "id": "of",
      "type": "DEV_SKILLS",
      "name": "Open Frameworks | (C++).",
      "points": 2,
      "desc": "<p>Similar to Processing, I've used Open Frameworks for creative coding experiments.  C++ is a different kettle of fish altogether. But it's been fun having lower level access to the environment</p>"
    },
    {
      "id": "aws",
      "type": "DEV_SKILLS",
      "name": "AWS.",
      "points": 2,
      "desc": "<p>I have deployed various bits and bobs to AWS over the past couple of years.  Mostly using EC2 instances. It's one thing I think would be valuable and would like to learn more about, especially CloudFront for scaling apps.</p>"
    },
    {
      "id": "svg",
      "type": "DEV_SKILLS",
      "name": "SVG.",
      "points": 3,
      "desc": "<p>SVG is great for creating visual content with JS.  I've learned a few tricks reagrding manipulating SVGs programmatically.</p>"
    },
    {
      "id": "platform",
      "type": "DEV_SKILLS",
      "name": "The Web Platform.",
      "points": 6,
      "desc": "<p>The browser now comes with so many cool APIs and features.  The best thing about the web as a platform is being able to connect all these things together easily and seemlessly. My new favourite is WebAudio and WebMidi.  But i've had play with most of them at some point. The sky is the limit.</p>"
    },
    {
      "id": "team",
      "type": "SOFT_SKILLS",
      "name": "I've got your back.",
      "points": 6,
      "desc": "<p>A team is only as strong as it's weakest member. I believe you should never pass up an opportunity to help out someone who needs it. Besides, you never know when you might need help.</p>"
    },
    {
      "id": "comms",
      "type": "SOFT_SKILLS",
      "name": "Let's talk about it.",
      "points": 6,
      "desc": "<p>Honesty is the best way to prevent problems from becoming bigger problems.  I believe in being honest when it comes to time, effort and estimation.  If something is going to be difficult.</p>"
    },
    {
      "id": "self-init",
      "type": "SOFT_SKILLS",
      "name": "Working Alone.",
      "points": 6,
      "desc": "<p>It's good working with other people. But it's important to be self-motivated. I just like building things.  Money's good, but it's making stuff that makes me tick.</p>"
    },
    {
      "id": "adobe",
      "type": "SOFT_SKILLS",
      "name": "Adobe Illustrator / Illustration / Vector Art / SVG.",
      "points": 4,
      "desc": "<p>I doodle.  Through freelance (and personal) projects I've used Adobe illustrator.  I've made illustrations for various projects / clients through out the years. I'm hardly Leonardo DaVinci, but it's another string to my bow and comes in handy.</p>"
    },
    {
      "id": "agile",
      "type": "SOFT_SKILLS",
      "name": "Agile Methodology.",
      "points": 4,
      "desc": "<p>I have experience of working in an agile software dev environment and, more importantly, understand the benefits it brings. Transparency, planning, </p>"
    },
    {
      "id": "design",
      "type": "SOFT_SKILLS",
      "name": "Design / UX / UI.",
      "points": 5,
      "desc": "<p>Having worked on front end for a while, I understand the importance of user journies and always consider UI / UX when building something. Design are not infalable (sayyyy whaaaat!?) and it's important to talk about UI / UX issues openly.</p>"
    },
    {
      "id": "learner",
      "type": "SOFT_SKILLS",
      "name": "Lifelong Learner.",
      "points": 4,
      "desc": "<p>I have never studied computer science, web development or telecommunications at university.  I'm self taught, everything I've learned it;s been through reading, doing and listening to other people. I think that gives me a unique perspective in terms of learning.  I learn because I love doing it, not to tick a box or get a certificate. It's an ongoing journey</p>"
    },
    {
      "id": "bad-dancing",
      "type": "SOFT_SKILLS",
      "name": "Awesome Dancer",
      "points": 4,
      "desc": "<p>I'm, like, the best dancer out there, don't listen to my girlfriend, or my friends, parents, relatives, acquaintences, neighbours, dog or the entire internet they don't know know what they're talking about.  Seriously, my moves are UN-BEE-LIEVABLE.  Seriously, just ask I'll send you a video.</p>"
    },
    {
      "id": "problem-solving",
      "type": "SOFT_SKILLS",
      "name": "For fixes sake.",
      "points": 5,
      "desc": "<p>Whilst coding obviously involves a high degree of problem solving, it's a skill that I also try to apply outwith programming. I like making stuff to solve new and interesting problems.  Life is all about dealing with challenges.</p>"
    }
  ]
}